MBronsom/OfflineSWD/STM32-OffineSWD/RL/USB/Drivers/usbh_stm32f10x.c
/*------------------------------------------------------------------------------
 *      RL-ARM - USB
 *------------------------------------------------------------------------------
 *      Name:    usbh_stm32f10x.c
 *      Purpose: Full/Low-speed Host STM32F10x Driver module
 *      Rev.:    V4.70
 *------------------------------------------------------------------------------
 *      This code is part of the RealView Run-Time Library.
 *      Copyright (c) 2004-2013 KEIL - An ARM Company. All rights reserved.
 *----------------------------------------------------------------------------*/

#include <RTL.h>
#include <rl_usb.h>
#include "usbh_stm32f10x.h"
#include <stm32f10x_cl.h>
#include <string.h>


/************************** Host Controller Driver Structure ******************/

USBH_HCD usbh0_hcd = {                  /* Host Controller Driver structure   */
  USBH_STM32_Get_Capabilities,          /* Get Host Ctrl Driver capabilities  */
  USBH_STM32_Delay_ms,                  /* Delay in ms                        */
  USBH_STM32_Pins_Config,               /* Config/Unconfig pins               */
  USBH_STM32_Init,                      /* Init/Uninit Host Controller        */
  USBH_STM32_Port_Power,                /* On/Off Port Power                  */
  USBH_STM32_Port_Reset,                /* Reset port                         */
  USBH_STM32_Get_Connect,               /* Get port conn/disconn status       */
  USBH_STM32_Get_Speed,                 /* Get port enumerated speed          */
  USBH_STM32_EP_Add,                    /* Add Endpoint                       */
  USBH_STM32_EP_Config,                 /* (Re)Configure Endpoint             */
  USBH_STM32_EP_Remove,                 /* Remove Endpoint                    */
  USBH_STM32_URB_Submit,                /* Submit USB Block Request           */
  USBH_STM32_URB_Cancel                 /* Cancel USB Block Request           */
};


/************************** Driver Settings ***********************************/

//-------- <<< Use Configuration Wizard in Context Menu >>> --------------------

//  <o0> Size of memory used by the OTG_FS USB Host Controller <1-1048576>
//  <i> This is a size of memory (in bytes) that the USB Host Controller 
//  <i> will use for USB communication data.
#define USBH_STM32_SZ_MPOOL         0x00000234


/************************** Variable and Memory Definitons ********************/

#define MAX_TIMEOUT_COUNT         100
#define DEBOUNCE_500ms            500

#define OTG_MAX_CH                8

#define OTG                       OTG_FS

static U32 *OTG_DFIFO[OTG_MAX_CH] = { OTG_FS_DFIFO0, OTG_FS_DFIFO1, 
                                      OTG_FS_DFIFO2, OTG_FS_DFIFO3, 
                                      OTG_FS_DFIFO4, OTG_FS_DFIFO5, 
                                      OTG_FS_DFIFO6, OTG_FS_DFIFO7  };

/* Reserve memory for memory pool */ 
       U32       USBH_MPOOL[(USBH_STM32_SZ_MPOOL+3)>>2];

static BOOL      HW_Accessing                      = { __FALSE };
static USBH_URB *CHURB             [OTG_MAX_CH]    = { 0 };
static U8        cntInterval       [OTG_MAX_CH]    = { 0 };
static U8        cntIntervalMax    [OTG_MAX_CH]    = { 0 };
static U16       cntDebounce                       = { 0 };
static U32       calDelay                          =   0  ;
static U32       Port_Discon_Evt                   = { 0 };
static U32       Port_Speed                        = { 0 };
static U32       Port_Con                          = { 0 };


/************************** Local Module Functions ****************************/

/***----------------------- DMA Functions ----------------------------------***/

/*------------------------- USBH_STM32_DMA_Enable ------------------------------
 *
 *  Enable the DMA so it can be used for USB
 *
 *  Parameter:              None
 *  Return:                 None
 *----------------------------------------------------------------------------*/

__inline static void USBH_STM32_DMA_Enable (void) {
  RCC->AHBENR  |=  1;                             /* Enable DMA1 clock, DMA1  */
                                                  /* will be used to load     */
                                                  /* TX FIFO                  */
}


/*------------------------- USBH_STM32_DMA_Disable -----------------------------
 *
 *  Disable the DMA previoucly used for USB
 *
 *  Parameter:              None
 *  Return:                 None
 *----------------------------------------------------------------------------*/
#if 0
__inline static void USBH_STM32_DMA_Disable (void) {
  RCC->AHBENR  &= ~1;                             /* Disable DMA1 clock       */
}
#endif


/*------------------------- USBH_STM32_DMA_Stop --------------------------------
 *
 *  Stop the DMA transfer
 *
 *  Parameter:              None
 *  Return:                 __TRUE = Ok, __FALSE = error
 *----------------------------------------------------------------------------*/

__inline static BOOL USBH_STM32_DMA_Stop (void) {
  S32 tout;

  DMA1_CH1->CCR = 0;                              /* Stop the DMA transfer    */
  for (tout = 1010; tout >= 0; tout--) {          /* Wait max 100 ms          */
    if (!(DMA1_CH1->CCR & 1))                     /* Wait for DMA to disable  */
      break;
    if (!tout) 
      return (__FALSE);
    if (tout <= 10)
      USBH_STM32_Delay_ms (10);
  }

  return (__TRUE);
}


/*------------------------- USBH_STM32_DMA_Start -------------------------------
 *
 *  Start the DMA transfer
 *
 *  Parameter:  ptrDest:    Pointer to Destination addres of transfer
 *              ptrSrc:     Pointer to Source address of transfer
 *              len:        Number of bytes to transfer
 *  Return:                 __TRUE = Ok, __FALSE = error
 *----------------------------------------------------------------------------*/

__inline static BOOL USBH_STM32_DMA_Start (U32 *ptrDest, U32 *ptrSrc, U16 len) {

  DMA1->IFCR      =  0x0F;                        /* Clear DMA interrupts     */
  DMA1_CH1->CMAR  = (uint32_t)ptrSrc;             /* Load source address      */
  DMA1_CH1->CPAR  = (uint32_t)ptrDest;            /* Load destination address */
  DMA1_CH1->CNDTR = (len+3)/4;                    /* Set size of transfer     */
  DMA1_CH1->CCR   = (1 << 14) |                   /* MEM2MEM enable           */
                    (0 << 12) |                   /* Priority Level low (PL=0)*/
                    (2 << 10) |                   /* Memory size 32 bits      */
                    (2 <<  8) |                   /* Peripheral size 32 bits  */
                    (1 <<  7) |                   /* Memory increment enable  */
                    (1 <<  6) |                   /* Peripheral increment en  */
                    (0 <<  5) |                   /* CIRC = 0                 */
                    (1 <<  4) |                   /* Direction from memory    */
                    (0 <<  3) |                   /* TEIE = 0                 */
                    (0 <<  2) |                   /* HTIE = 0                 */
                    (0 <<  1) ;                   /* TCIE = 0                 */
  DMA1_CH1->CCR  |= (1 <<  0) ;                   /* Channel enable           */

  return (__TRUE);
}


/*------------------------- USBH_STM32_DMA_Wait --------------------------------
 *
 *  Wait for the DMA transfer to finish and cleanup DMA for next transfer 
 *
 *  Parameter:              None
 *  Return:                 __TRUE = Ok, __FALSE = error
 *----------------------------------------------------------------------------*/

__inline static BOOL USBH_STM32_DMA_Wait (void) {
  S32 tout;

  for (tout = 1010; tout >= 0; tout--) {          /* Wait max 100 ms          */
    if (!(DMA1_CH1->CCR&1) || !(DMA1_CH1->CNDTR)) /* If prev trans completed  */
      break;
    if (!tout) 
      return (__FALSE);
    if (tout <= 10)
      USBH_STM32_Delay_ms (10);
  }
  if (!USBH_STM32_DMA_Stop())                     /* Stop the DMA transfer    */
    return (__FALSE);

  return (__TRUE);
}


/***----------------------- Channel Functions ------------------------------***/

/*------------------------- USBH_STM32_CH_GetIndexFromCH -----------------------
 *
 *  Get the Index of Channel from it's Address
 *
 *  Parameter:  ptrCH:      Pointer to the Channel
 *  Return:                 Index of the Channel
 *----------------------------------------------------------------------------*/

static U32 USBH_STM32_CH_GetIndexFromCH (USBH_STM32_CH *ptrCH) {
  return (ptrCH - (USBH_STM32_CH *)(&(OTG->HCCHAR0)));
}


