MBronsom/OfflineSWD/STM32-OffineSWD/RL/USB/Drivers/usbh_stm32f10x.c
/*------------------------- USBH_STM32_CH_GetCHFromIndex -----------------------
 *
 *  Get the Channel Address from it's Index
 *
 *  Parameter:  idx:        Index of the Channel
 *  Return:                 Address of the Channel
 *----------------------------------------------------------------------------*/

static USBH_STM32_CH *USBH_STM32_CH_GetCHFromIndex (U32 idx) {
  return ((USBH_STM32_CH *)(&(OTG->HCCHAR0)) + idx);
}


/*------------------------- USBH_STM32_CH_FindFree -----------------------------
 *
 *  Find a free Channel
 *
 *  Parameter:
 *  Return:                 Pointer to the first free Channel
 *                          (0 = no free Channel is available)
 *----------------------------------------------------------------------------*/

static void *USBH_STM32_CH_FindFree (void) {
  USBH_STM32_CH *ptr_CH;
  U32            i;

  ptr_CH = (USBH_STM32_CH *)(&(OTG->HCCHAR0));

  for (i = 0; i < OTG_MAX_CH; i++) {
    if (!ptr_CH->HCCHAR) {
      return (ptr_CH);
    }
    ptr_CH++;
  }

  return (0);
}


/*------------------------- USBH_STM32_CH_Disable ------------------------------
 *
 *  Disable the Channel
 *
 *  Parameter:  ptrCH:      Pointer to the Channel
 *  Return:                 __TRUE = Ok, __FALSE = error
 *----------------------------------------------------------------------------*/

static BOOL USBH_STM32_CH_Disable (USBH_STM32_CH *ptrCH) {
  S32 tout;

  if (!ptrCH) 
    return (__FALSE);

  ptrCH->HCINTMSK  =  0;
  USBH_STM32_Delay_ms (2);
  if (ptrCH->HCCHAR & USBH_STM32_HCCHAR_CHENA) {
    if (!(ptrCH->HCCHAR & USBH_STM32_HCCHAR_EPDIR) && (ptrCH->HCTSIZ)) {
      if (!USBH_STM32_DMA_Stop())
        return (__FALSE);
    }
    ptrCH->HCINT     =  ~USBH_STM32_HCINT_CHH;
    ptrCH->HCCHAR    =  (ptrCH->HCCHAR  |  USBH_STM32_HCCHAR_CHENA);
    USBH_STM32_Delay_ms (2);
    ptrCH->HCCHAR    =  (ptrCH->HCCHAR  & ~USBH_STM32_HCCHAR_CHENA) | USBH_STM32_HCCHAR_CHDIS;
    for (tout = 1010; tout >= 0; tout--) {        /* Wait max 100 ms          */
      if (ptrCH->HCINT & USBH_STM32_HCINT_CHH) 
        break;
      if ((ptrCH->HCCHAR & (USBH_STM32_HCCHAR_CHENA | USBH_STM32_HCCHAR_CHDIS)) == (USBH_STM32_HCCHAR_CHENA | USBH_STM32_HCCHAR_CHDIS)) 
        break;
      if (!tout) {
        return (__FALSE);
      }
      if (tout <= 10)
        USBH_STM32_Delay_ms (10);
    }
  }

  return (__TRUE);
}


/*------------------------- USBH_STM32_CH_TransferEnqueue ----------------------
 *
 *  Enqueue the Transfer
 *
 *  Parameter:  ptrCH:      Pointer to the channel on which transfer will take place
 *              tgl_typ:    Toggle (bit 5..4: bit 5 - force toggle, bit 4 - value) and 
 *                          Packet type (bit 3..0: USBH_PACKET_IN, USBH_PACKET_OUT or USBH_PACKET_SETUP)
 *              buf:        Start of the receive or transmit data buffer
 *              len:        Length of the data to be received or sent
 *  Return:                 __TRUE = Ok, __FALSE = error
 *----------------------------------------------------------------------------*/

static BOOL USBH_STM32_CH_TransferEnqueue (USBH_STM32_CH *ptrCH, U32 tgl_typ, U8 *buf, U32 len) {
  U32  hcchar;
  U32  hctsiz;
  U32  hcintmsk;
  U32  mpsiz;
  U32  ch_idx;
  BOOL load_data;

  if (!ptrCH)
    return (__FALSE);

  if (!Port_Con)
    return (__FALSE);

  hcchar   = ptrCH->HCCHAR;                       /* Read channel characterist*/
  hctsiz   = ptrCH->HCTSIZ;                       /* Read channel size info   */
  hcintmsk = 0;

  /* Prepare transfer                                                         */
                                                  /* Prepare HCCHAR register  */
  hcchar &= USBH_STM32_HCCHAR_ODDFRM|             /* Keep ODDFRM              */
            USBH_STM32_HCCHAR_DAD   |             /* Keep DAD                 */
            USBH_STM32_HCCHAR_MCNT  |             /* Keep MCNT                */
            USBH_STM32_HCCHAR_EPTYP |             /* Keep EPTYP               */
            USBH_STM32_HCCHAR_LSDEV |             /* Keep LSDEV               */
            USBH_STM32_HCCHAR_EPNUM |             /* Keep EPNUM               */
            USBH_STM32_HCCHAR_MPSIZ ;             /* Keep MPSIZ               */
  switch (tgl_typ & 0x0F) {
    case USBH_PACKET_IN:
      hcchar   |=  USBH_STM32_HCCHAR_EPDIR;
      hcintmsk  =  USBH_STM32_HCINTMSK_DTERRM | 
                   USBH_STM32_HCINTMSK_BBERRM | 
                   USBH_STM32_HCINTMSK_TXERRM | 
                   USBH_STM32_HCINTMSK_ACKM   | 
                   USBH_STM32_HCINTMSK_NAKM   | 
                   USBH_STM32_HCINTMSK_STALLM | 
                   USBH_STM32_HCINTMSK_XFRCM  ;
      break;
    case USBH_PACKET_OUT:
      hcchar   &= ~USBH_STM32_HCCHAR_EPDIR;
      hcintmsk  =  USBH_STM32_HCINTMSK_TXERRM | 
                   USBH_STM32_HCINTMSK_NYET   | 
                   USBH_STM32_HCINTMSK_NAKM   | 
                   USBH_STM32_HCINTMSK_STALLM | 
                   USBH_STM32_HCINTMSK_XFRCM  ;
      break;
    case USBH_PACKET_SETUP:
      hcchar   &= ~USBH_STM32_HCCHAR_EPDIR;
      hcintmsk  =  USBH_STM32_HCINTMSK_TXERRM | 
                   USBH_STM32_HCINTMSK_NAKM   | 
                   USBH_STM32_HCINTMSK_STALLM | 
                   USBH_STM32_HCINTMSK_XFRCM  ;
      break;
  }
  hcchar &= ~USBH_STM32_HCCHAR_CHDIS;
  hcchar |=  USBH_STM32_HCCHAR_CHENA;

                                                  /* Prepare HCTSIZ register  */
  hctsiz &= USBH_STM32_HCTSIZ_DPID;               /* Keep DPID                */
  if ((tgl_typ & 0x0F) == USBH_PACKET_SETUP) {    /* If setup pckt DPID=MDATA */
    hctsiz &= ~USBH_STM32_HCTSIZ_DPID;
    hctsiz |=  USBH_STM32_HCTSIZ_DPID_MDATA;
  } else if ((tgl_typ >> 5) & 1) {                /* If toggle force bit activ*/
    if ((tgl_typ >> 4) & 1) {                     /* Toggle bit value         */
      hctsiz &= ~USBH_STM32_HCTSIZ_DPID;
      hctsiz |=  USBH_STM32_HCTSIZ_DPID_DATA1;
    } else {
      hctsiz &= ~USBH_STM32_HCTSIZ_DPID;
      hctsiz |=  USBH_STM32_HCTSIZ_DPID_DATA0;
    }
  }

  mpsiz = hcchar & 0x7FF;                         /* Maximum packet size      */
  if (len) {                                      /* Normal packet            */
    hctsiz |= ((len+mpsiz-1) / mpsiz) << 19;      /* Prepare PKTCNT field     */
    hctsiz |= ( len                 ) <<  0;      /* Prepare XFRSIZ field     */
  } else {                                        /* Zero length packet       */
    hctsiz |= ( 1                   ) << 19;      /* Prepare PKTCNT field     */
    hctsiz |= ( 0                   ) <<  0;      /* Prepare XFRSIZ field     */
  }

