MBronsom/OfflineSWD/STM32-OffineSWD/RL/USB/Drivers/usbh_stm32f10x.c
  ch_idx  = USBH_STM32_CH_GetIndexFromCH (ptrCH);

  ptrCH->HCINTMSK = hcintmsk;                     /* Enable channel interrupts*/
  ptrCH->HCTSIZ   = hctsiz;                       /* Write ch transfer size   */

  /* load_data == __TRUE if there is data to be loaded to FIFO 
    (If packet is OUT or SETUP and len > 0)                                   */
  load_data = (((tgl_typ & 0x0F) == USBH_PACKET_OUT)    || 
               ((tgl_typ & 0x0F) == USBH_PACKET_SETUP)) && 
                 len; 

  if (load_data)
    USBH_STM32_DMA_Wait();

  ptrCH->HCCHAR = hcchar;                         /* Write ch characteristics */

  if (load_data)
    USBH_STM32_DMA_Start (OTG_DFIFO[ch_idx], (U32 *)(buf), len);

  return (__TRUE);
}


/************************** Module Functions **********************************/

/*------------------------- USBH_STM32_Get_Capabilities ------------------------
 *
 *  Get capabilities of Host Controller Driver
 *
 *  Parameter:  cap:        Pointer to USBH_HCI_CAP structure where 
 *                          capabilities are loaded
 *  Return:
 *----------------------------------------------------------------------------*/

void USBH_STM32_Get_Capabilities (USBH_HCI_CAP *cap) {
  cap->MultiPckt = __TRUE;
  cap->MaxDataSz = 512;
  cap->CtrlNAKs  = 100000;
  cap->BulkNAKs  = 1000000;
}


/*------------------------- USBH_STM32_Delay_ms --------------------------------
 *
 *  Delay execution (in milliseconds)
 *  Calibration is done if global variable calDelay is 0
 *
 *  Parameter:  ms:         Number of milliseconds to delay execution for
 *  Return:
 *----------------------------------------------------------------------------*/

void USBH_STM32_Delay_ms (U32 ms) {
  U32 cnt = 0, vals = 0, vale = 0;

start:
  if (!calDelay) {                      /* If not calibrated                  */
    cnt = 1000;
    if (!(SysTick->CTRL & SysTick_CTRL_ENABLE_Msk)) {
                                        /* If SysTick timer not running       */
      vals = 0xFFFFFF;
      SysTick->LOAD  = 0xFFFFFF;
      SysTick->VAL   = 0xFFFFFF;
      SysTick->CTRL  = SysTick_CTRL_CLKSOURCE_Msk | 
                       SysTick_CTRL_ENABLE_Msk;
    } else {
      vals = SysTick->VAL;              /* Timer start value                  */
    }
  } else {
    cnt = ms * calDelay;
  }

  while (cnt--);

  if (!calDelay) {                      /* If not calibrated                  */
    vale = SysTick->VAL;                /* Timer end value                    */
    if (vale >= vals)                   /* If timer reloaded                  */
      vals += SysTick->LOAD;
    calDelay = SystemFrequency / (vals - vale);   /* Calibrated value         */
    if (vals == 0xFFFFFF)               /* Stop timer if we started it        */
      SysTick->CTRL  = 0;
    goto start;
  }
}


/*------------------------- USBH_STM32_Pins_Config -----------------------------
 *
 *  Configurate or unconfigurate pins used by the USB Host
 *
 *  Parameter:  on:         __TRUE = configurate, __FALSE = unconfigurate
 *  Return:                 __TRUE = Ok, __FALSE = error
 *----------------------------------------------------------------------------*/

BOOL USBH_STM32_Pins_Config (BOOL on) {

  if (on) {
    RCC->APB2ENR  |=  (   1 <<  4);     /* Enable GPIOC port clock            */
    GPIOC->BSRR    =  (   1 <<  9);     /* PC9 drive high                     */
    GPIOC->CRH    &= ~(0x0F <<  4);     /* Clear PC9 configuration            */
    GPIOC->CRH    |=  (   1 <<  6)|     /* PC9 general purpose open-drain     */
                      (   1 <<  4);     /* PC9 output mode (10 MHz)           */
    USBH_STM32_Port_Power ( __FALSE);   /* Turn off port power                */
  } else {
    GPIOC->CRH    &= ~(0x0F <<  4);     /* Clear PC9 configuration            */
    GPIOC->CRH    |=  (0x04 <<  4);     /* Float Input (reset state)          */
  }

  return (__TRUE);
}


/*------------------------- USBH_STM32_Init ------------------------------------
 *
 *  Initialize or uninitialize the USB Host Controller
 *
 *  Parameter:  on:         __TRUE = initialize, __FALSE = uninitialize
 *  Return:                 __TRUE = Ok, __FALSE = error
 *----------------------------------------------------------------------------*/

BOOL USBH_STM32_Init (BOOL on) {
  S32 tout;

  if (on) {
    /* Initialize memory pool for data                                        */
    if (!usbh_mem_init(0, (U32 *)&USBH_MPOOL, USBH_STM32_SZ_MPOOL))
      return (__FALSE);

    RCC->AHBENR     |=  (   1 << 12);   /* OTG FS clock enable                */

    OTG->GRSTCTL |= 1;                            /* USB Core Reset           */
    for (tout = 100; tout >= 0; tout--) {         /* Wait max 1 second        */
      if (!(OTG->GRSTCTL & 1))                    /* Wait for Core Reset end  */
        break;
      if (!tout) {
        return (__FALSE);
      }
      USBH_STM32_Delay_ms (10);
    }
    USBH_STM32_DMA_Enable ();

    USBH_STM32_Delay_ms (100);                    /* Wait ~100 ms             */

    /* Core initialization                                                    */
    OTG->GAHBCFG   |=  USBH_STM32_GAHBCFG_GINTMSK;    /* Enable interrupts    */
    OTG->GUSBCFG   &=~(USBH_STM32_GUSBCFG_FHMOD  |    /* Clear register       */
                       USBH_STM32_GUSBCFG_TRDT(15)|
                       USBH_STM32_GUSBCFG_PHYSEL);
    OTG->GUSBCFG    =  USBH_STM32_GUSBCFG_FHMOD  |    /* Force host mode      */
                       USBH_STM32_GUSBCFG_PHYSEL |    /* Full-spd transceiver */
                       USBH_STM32_GUSBCFG_TRDT(5);    /* Turnaround time      */
    USBH_STM32_Delay_ms (100);                    /* Wait ~100 ms             */

    OTG->GRXFSIZ    =  (512/4) +                    /* RxFIFO depth is 512 by */
                             2  +                   /* 8 bytes for Int EP     */
                             4  ;                   /* Packet info and status */
    OTG->GNPTXFSIZ  = ((512/4)<<16) | ((512/4)+6);    /* Non-periodic TxFIFO  */
    OTG->HPTXFSIZ   = (16<<16) |  (((512/4)*2)+6);    /* Periodic TxFIFO mem  */
    OTG->GCCFG     |=  USBH_STM32_GCCFG_SOFOUTEN |    /* Enable SOF output    */
                       USBH_STM32_GCCFG_PWRDWN   ;    /* Disable power down   */

