MBronsom/OfflineSWD/STM32-OffineSWD/RL/USB/Drivers/usbh_stm32f10x.c
    OTG->GINTMSK   |=  USBH_STM32_GINTMSK_DISCINT|    /* Enable disconn int   */
                       USBH_STM32_GINTMSK_HCIM   |    /* Enable host ch int   */
                       USBH_STM32_GINTMSK_PRTIM  |    /* Enable host prt int  */
                       USBH_STM32_GINTMSK_RXFLVLM|    /* Enable RXFIFO int    */
                       USBH_STM32_GINTMSK_SOFM   ;    /* Enable SOF int       */
    if (!(OTG->HCFG & 3)) {
      OTG->HCFG     =  USBH_STM32_HCFG_FSLSPCS(1)|    /* PHY clk at 48MHz     */
                       USBH_STM32_HCFG_FSLS(1)   ;    /* FS/LS only           */
    }
    OTG->HAINTMSK   =  0xFF;                          /* Enable all ch ints   */

    NVIC_SetPriority (OTG_FS_IRQn, 0);  /* Set OTG interrupt highest priority */
    NVIC_EnableIRQ   (OTG_FS_IRQn);     /* Enable OTG interrupt               */
  } else {
    NVIC_DisableIRQ  (OTG_FS_IRQn);     /* Disable OTG interrupt              */

    OTG->HAINTMSK  &= ~0xFF;            /* Disable channel interrupts         */
    RCC->AHBSTR    |=  (   1 << 12);    /* OTG FS reset                       */
    RCC->AHBSTR    &= ~(   1 << 12);    /* OTG FS not reset                   */
    RCC->AHBENR    &= ~(   1 << 12);    /* OTG FS clock disable               */

    OTG->HPRT       =  0;                           /* Reset host port control*/
    OTG->HCFG       =  0;                           /* Reset host config      */
    OTG->GINTMSK   &=~(USBH_STM32_GINTMSK_DISCINT|  /* Disable interrupts     */
                       USBH_STM32_GINTMSK_HCIM   |
                       USBH_STM32_GINTMSK_PRTIM  |
                       USBH_STM32_GINTMSK_RXFLVLM|
                       USBH_STM32_GINTMSK_SOFM  );
    OTG->GUSBCFG   &=~(USBH_STM32_GUSBCFG_FHMOD  |  /* Reset USB config fields*/
                       USBH_STM32_GUSBCFG_PHYSEL | 
                       USBH_STM32_GUSBCFG_TRDT(15));
    OTG->GUSBCFG   |=  USBH_STM32_GUSBCFG_TRDT(2);  /* Set init values        */
    calDelay = 0;                                 /* Force delay recalibrate  */
  }

  return (__TRUE);
}


/*------------------------- USBH_STM32_Port_Power ------------------------------
 *
 *  Turn USB Host port power on or off
 *
 *  Parameter:  on:         __TRUE = power on, __FALSE = power off
 *  Return:                 __TRUE = Ok, __FALSE = error
 *----------------------------------------------------------------------------*/

BOOL USBH_STM32_Port_Power (BOOL on) {

  if (on) {
    OTG->HPRT    |=  USBH_STM32_HPRT_PPWR;        /* Port power on            */
    GPIOC->BRR    =  (   1 <<  9);                /* PC9 drive low            */
  } else { 
    GPIOC->BSRR   =  (   1 <<  9);                /* PC9 drive high           */
    OTG->HPRT    &= ~USBH_STM32_HPRT_PPWR;        /* Port power off           */
  }

  return (__TRUE);
}


/*------------------------- USBH_STM32_Port_Reset ------------------------------
 *
 *  Reset Port
 *
 *  Parameter:  port:       Root Hub port to be reset (only 0 is available)
 *  Return:                 __TRUE = Ok, __FALSE = error
 *----------------------------------------------------------------------------*/

BOOL USBH_STM32_Port_Reset (U8 port) {
  U32 hcfg, hprt;
  S32 tout;

  if (!Port_Con)
    return (__FALSE);

  hcfg = OTG->HCFG;
  hprt = OTG->HPRT;
  switch ((hprt >> 17) & 3) {
    case 0:                             /* High-speed detected                */
      break;
    case 1:                             /* Full-speed detected                */
      OTG->HFIR  = 48000;
      if ((hcfg & 3) != 1) {
        hcfg       = (hcfg & ~USBH_STM32_HCFG_FSLSPCS(3)) | USBH_STM32_HCFG_FSLSPCS(1);
        OTG->HCFG  =  hcfg;
      }
      break;
    case 2:                             /* Low-speed detected                 */
      OTG->HFIR  = 6000;
      if ((hcfg & 3) != 2) {
        hcfg       = (hcfg & ~USBH_STM32_HCFG_FSLSPCS(3)) | USBH_STM32_HCFG_FSLSPCS(2);
        OTG->HCFG  =  hcfg;
      }
      break;
    case 3:
      break;
  }

  OTG->HPRT |=  USBH_STM32_HPRT_PRST;                 /* Port reset           */
  USBH_STM32_Delay_ms (17);                           /* Wait ~17 ms          */
  OTG->HPRT &= ~USBH_STM32_HPRT_PRST;                 /* Clear port reset     */

  for (tout = 10100; tout >= 0; tout--) {             /* Wait for max 1 s     */
    if ((OTG->HPRT & USBH_STM32_HPRT_PENA))           /* If port enabled      */
      break;
    if (!tout) 
      return (__FALSE);
    if (tout <= 100)
      USBH_STM32_Delay_ms (10);                       /* Wait ~10 ms          */
  }
  USBH_STM32_Delay_ms (20);                           /* Wait ~20 ms          */

  return (__TRUE);
}


/*------------------------- USBH_STM32_Get_Connect -----------------------------
 *
 *  Returns connect/disconnect port events (also does debouncing)
 *
 *  Parameter:              None
 *  Return:                 Connection/Disconnection events
 *----------------------------------------------------------------------------*/

U32 USBH_STM32_Get_Connect (void) {
  U32 ret, stat;

  stat = (OTG->HPRT & USBH_STM32_HPRT_PCSTS);
  ret  = Port_Discon_Evt;
  ret |= ((stat ^ Port_Con) && (Port_Con));

  if (ret){                             /* If port disconnect occured         */
    Port_Discon_Evt &= ~ret;
    return (ret << 16);
  }

  if (cntDebounce) {
    cntDebounce--;
    if (!cntDebounce) {                 /* If debounce time expired           */
      ret = ((stat ^ Port_Con) && (!Port_Con));
                                        /* If debounce expired on conn 0 -> 1 */
      Port_Con |= ret;
    } else {
      USBH_STM32_Delay_ms (1);
    }
  } else if ((stat ^ Port_Con) && (!Port_Con)) {
                                        /* Restart debouncing if connect      */
    cntDebounce = DEBOUNCE_500ms;
  }

  return (ret);
}


/*------------------------- USBH_STM32_Get_Speed -------------------------------
 *
 *  Returns port speeds
 *
 *  Parameter:              None
 *  Return:                 Port speeds
 *----------------------------------------------------------------------------*/

U32 USBH_STM32_Get_Speed (void) {
  return (Port_Speed); 
}


/*------------------------- USBH_STM32_EP_Add ----------------------------------
 *
 *  Add the Endpoint and return handle (address of the Endpoint)
 *
 *  Parameter:  dev_adr:    Device Address
 *              ep_spd:     Endpoint Speed
 *              ptrEPD:     Pointer to the USB Standard Endpoint Descriptor
 *  Return:                 Handle to the Configured Endpoint (0 = FAIL)
 *----------------------------------------------------------------------------*/

U32 USBH_STM32_EP_Add (U8 dev_adr, U8 ep_spd, USB_ENDPOINT_DESCRIPTOR *ptrEPD) {
  USBH_STM32_CH *ptr_CH;

  ptr_CH = (USBH_STM32_CH *)(USBH_STM32_CH_FindFree ());  /* Find free Channel*/
  if (!ptr_CH) {                                          /* If no free exists */
    return (0);
  }

  /* Fill in all fields from the USB Standard Endpoint Descriptor             */
  ptr_CH->HCCHAR = (((ptrEPD->wMaxPacketSize       ) & 0x07FF)       <<  0) | 
                   (((ptrEPD->bEndpointAddress     ) & 0x000F)       << 11) | 
                   (((ptrEPD->bEndpointAddress >> 7) & 0x0001)       << 15) | 
                   ((ep_spd == USBH_LS)                              << 17) |
                   ((ptrEPD->bmAttributes & USB_ENDPOINT_TYPE_MASK)  << 18) | 
                   ((dev_adr                         & 0x007F)       << 22) ;

