MBronsom/OfflineSWD/STM32-OffineSWD/RL/USB/Drivers/usbh_stm32f10x.c
  switch (ptrEPD->bmAttributes & USB_ENDPOINT_TYPE_MASK) {
    case USB_ENDPOINT_TYPE_CONTROL:
    case USB_ENDPOINT_TYPE_BULK:
      break;
    case USB_ENDPOINT_TYPE_ISOCHRONOUS:
    case USB_ENDPOINT_TYPE_INTERRUPT:
      cntIntervalMax[USBH_STM32_CH_GetIndexFromCH (ptr_CH)] = ptrEPD->bInterval;
      ptr_CH->HCCHAR |= USBH_STM32_HCCHAR_MCNT1;
      break;
  }

  return ((U32)ptr_CH);
}


/*------------------------- USBH_STM32_EP_Config -------------------------------
 *
 *  (Re)Configure some parameters of the Endpoint
 *
 *  Parameter:  hndl:       Handle to the Configured Endpoint
 *              dev_adr:    Device Address
 *              ep_spd:     Endpoint Speed
 *              ptrEPD:     Pointer to the USB Standard Endpoint Descriptor
 *  Return:                 __TRUE = Ok, __FALSE = error
 *----------------------------------------------------------------------------*/

BOOL USBH_STM32_EP_Config (U32 hndl, U8 dev_adr, U8 ep_spd, USB_ENDPOINT_DESCRIPTOR *ptrEPD) {
  USBH_STM32_CH *ptr_CH;

  if (!hndl) 
    return (__FALSE);

  ptr_CH = (USBH_STM32_CH *)(hndl);
  if (!USBH_STM32_CH_Disable (ptr_CH)) 
    return (__FALSE);

  /* Fill in all fields of Endpoint Descriptor                                */
  ptr_CH->HCCHAR = (((ptrEPD->wMaxPacketSize       ) & 0x07FF)       <<  0) | 
                   (((ptrEPD->bEndpointAddress     ) & 0x000F)       << 11) | 
                   (((ptrEPD->bEndpointAddress >> 7) & 0x0001)       << 15) | 
                   ((ep_spd == USBH_LS)                              << 17) |
                   ((ptrEPD->bmAttributes & USB_ENDPOINT_TYPE_MASK)  << 18) | 
                   ((dev_adr                         & 0x007F)       << 22) ;

  switch (ptrEPD->bmAttributes & USB_ENDPOINT_TYPE_MASK) {
    case USB_ENDPOINT_TYPE_CONTROL:
    case USB_ENDPOINT_TYPE_BULK:
      break;
    case USB_ENDPOINT_TYPE_ISOCHRONOUS:
    case USB_ENDPOINT_TYPE_INTERRUPT:
      ptr_CH->HCCHAR |= USBH_STM32_HCCHAR_MCNT1;
      break;
  }

  return (__TRUE);
}


/*------------------------- USBH_STM32_EP_Remove -------------------------------
 *
 *  Remove the Endpoint
 *
 *  Parameter:  hndl:       Handle to the Configured Endpoint
 *  Return:                 __TRUE = Ok, __FALSE = error
 *----------------------------------------------------------------------------*/

BOOL USBH_STM32_EP_Remove (U32 hndl) {
  USBH_STM32_CH *ptr_CH;
  USBH_URB      *ptr_URB;
  U32            ch_idx;

  if (!hndl) 
    return (__FALSE);

  ptr_CH = (USBH_STM32_CH *)(hndl);
  ch_idx              = USBH_STM32_CH_GetIndexFromCH (ptr_CH);
  ptr_URB = CHURB[ch_idx];              /* Pointer to channels URB            */
  if (ptr_URB) {                        /* If URB exists cancel it            */
    if (!USBH_STM32_URB_Cancel (hndl, ptr_URB)) 
      return (__FALSE);
  }

  ptr_CH->HCCHAR      = 0;
  ptr_CH->HCINT       = 0;
  ptr_CH->HCINTMSK    = 0;
  ptr_CH->HCTSIZ      = 0;

  cntInterval[ch_idx] = 0;

  return (__TRUE);
}


/*------------------------- USBH_STM32_URB_Submit ------------------------------
 *
 *  Submit the URB (USB Request Block) to be processed
 *
 *  Parameter:  hndl:       Endpoint handle (Endpoint address in memory)
 *              ptrURB:     Pointer to the URB
 *  Return:                 __TRUE = Ok, __FALSE = error
 *----------------------------------------------------------------------------*/

BOOL USBH_STM32_URB_Submit (U32 hndl, USBH_URB *ptrURB) {
  USBH_STM32_CH *ptr_CH;
  U32            ch_idx;
  U8             resp_type;

  if (!hndl) 
    return (__FALSE);

  if (!ptrURB) 
    return (__FALSE);

  if (!Port_Con)
    return (__FALSE);

  if ((ptrURB->Submitted == 1) || (ptrURB->InProgress == 1)) 
    return (__FALSE);

  resp_type               = ptrURB->ResponsePacketType;

  ptrURB->DataTransferred = 0;
  ptrURB->Status          = 0;

  ptrURB->TimeoutCount    = MAX_TIMEOUT_COUNT;
  ptr_CH                  = (USBH_STM32_CH *)(hndl);
  ch_idx                  = USBH_STM32_CH_GetIndexFromCH (ptr_CH);
  CHURB[ch_idx]           = ptrURB;

  if (ptr_CH->EPTYP == USB_ENDPOINT_TYPE_INTERRUPT) {
                                        /* If interrupt endpoint transfer     */
    if (resp_type == USBH_PACKET_NAK) {
      cntInterval[ch_idx] = cntIntervalMax[ch_idx];
    } else {
      cntInterval[ch_idx] = 1;          /* Enable transmission on next SOF    */
    }
    ptrURB->Submitted     = 1;
  } else if ((ptr_CH->EPTYP == USB_ENDPOINT_TYPE_CONTROL) || (ptr_CH->EPTYP == USB_ENDPOINT_TYPE_BULK)) {
    if ((Port_Speed & 3) != USBH_LS) {
      HW_Accessing        = __TRUE;
      ptrURB->Submitted   = 1;
      ptrURB->InProgress  = 1;
      USBH_STM32_CH_TransferEnqueue (ptr_CH, (U8)ptrURB->Parameters, (U8 *)ptrURB->ptrDataBuffer, (U32)ptrURB->DataLength);
      HW_Accessing        = __FALSE;
    } else {
      ptrURB->Submitted   = 1;
    }
  }

  return (__TRUE);
}


/*------------------------- USBH_STM32_URB_Cancel ------------------------------
 *
 *  Cancel the URB (USB Request Block)
 *
 *  Parameter:  hndl:       Endpoint handle (Endpoint address in memory)
 *              ptrURB:     Pointer to the URB
 *  Return:                 __TRUE = Ok, __FALSE = error
 *----------------------------------------------------------------------------*/

BOOL USBH_STM32_URB_Cancel (U32 hndl, USBH_URB *ptrURB) {
  USBH_STM32_CH *ptr_CH;
  U32            ch_idx;

  if (!hndl) 
    return (__FALSE);

  if (!ptrURB) 
    return (__FALSE);

  if (!ptrURB->Submitted) 
    return (__TRUE);

  ptrURB->Submitted = 0;

  ptr_CH = (USBH_STM32_CH *)(hndl);
  if (ptrURB->InProgress == 1) {
    if (!USBH_STM32_CH_Disable (ptr_CH))/* Stop Endpoint processing           */
      return (__FALSE);
    ptrURB->InProgress  = 0;
  }

  ch_idx = USBH_STM32_CH_GetIndexFromCH (ptr_CH);

  if (!cntInterval[ch_idx]) {           /* If interrupt endpoint transfer     */
    cntInterval[ch_idx] = 0;            /* Disable transmission on next SOF   */
  }
  CHURB[ch_idx] = 0;
  ptrURB->Cancelled = 1;

  return (__TRUE);
}


/*------------------------- OTG_FS_IRQHandler ----------------------------------
 *
 *  STM32 USB Interrupt Handler Routine
 *
 *  Parameter:
 *  Return:
 *----------------------------------------------------------------------------*/

void OTG_FS_IRQHandler (void) {
  USBH_STM32_CH  *ptr_CH;
  USBH_URB       *ptr_URB;
  U8             *ptrData8;
  U32            *ptrData32;
  U32            *DFIFO;
  U32             gintsts, hprt, haint, hcint, pktcnt, mpsiz;
  U32             grxsts, bcnt, ch, dat, len, len_rest;
  U32             act;

  /* Read global interrupt register                                           */
  gintsts =  OTG->GINTSTS & OTG->GINTMSK;
  hprt    =  OTG->HPRT;
  haint   =  OTG->HAINT;

  /* Analyze interrupt                                                        */
  if (gintsts & USBH_STM32_GINTSTS_SOF) {         /* If start of frame int    */
    for (ch = 0; ch < OTG_MAX_CH; ch++) {
      if (CHURB[ch]) {
        if (CHURB[ch]->TimeoutCount) {            /* If timeout not 0         */
          if (!(--CHURB[ch]->TimeoutCount)) {
            CHURB[ch]->Timeout = 1;               /* If timeout expired       */
          }
        }
      }
    }
  }

  if (gintsts&USBH_STM32_GINTSTS_HPRTINT) {       /* If host port interrupt   */
    if (hprt & USBH_STM32_HPRT_PCDET) {           /* Port connect detected    */
      if (!Port_Con) {
        cntDebounce = DEBOUNCE_500ms;
      }
    }
    if (hprt & USBH_STM32_HPRT_PENCHNG) {         /* If port enable changed   */
      if (hprt & USBH_STM32_HPRT_PENA) {          /* If device connected      */
        Port_Speed &= ~3;
        switch ((hprt >> 17) & 3) {
          case 0:
            break;
          case 1:
            Port_Speed |= USBH_FS;
            break;
          case 2:
            Port_Speed |= USBH_LS;
            break;
          case 3:
            break;
        }
      } 
      if (!(hprt & USBH_STM32_HPRT_PCSTS) &&      /* If device disconnected   */
            Port_Con) { 
        Port_Discon_Evt = 1;
        Port_Con        = 0;
      }
    }
    hprt &= ~USBH_STM32_HPRT_PENA;                /* Leave PENA bit           */
    OTG->HPRT = hprt;                             /* Clear host port interrupt*/
  }
  if ((gintsts & USBH_STM32_GINTSTS_DISCINT) &&   /* If device disconnected   */
       Port_Con) { 
    Port_Discon_Evt = 1;
    Port_Con        = 0;
  }

  if (Port_Discon_Evt) {                          /* If disconnect detected   */
    ptr_CH = (USBH_STM32_CH *)(&(OTG->HCCHAR0));
    for (ch = 0; ch < OTG_MAX_CH; ch++) {
      if (CHURB[ch]) 
        USBH_STM32_URB_Cancel ((U32)USBH_STM32_CH_GetCHFromIndex (ch), CHURB[ch]);
      ptr_CH++;
    }
  }
                                                  /* Handle reception int     */
  if (gintsts & USBH_STM32_GINTSTS_RXFLVL) {      /* If RXFIFO non-empty int  */
    OTG->GINTMSK &= ~USBH_STM32_GINTMSK_RXFLVLM;
    grxsts = OTG->GRXSTSR;
    if (((grxsts >> 17) & 0x0F) == 0x02){         /* If PKTSTS = 0x02         */
      grxsts     = (OTG->GRXSTSP);
      ch         = (grxsts >> 0) & 0x00F;
      bcnt       = (grxsts >> 4) & 0x7FF;
      ptr_CH     = USBH_STM32_CH_GetCHFromIndex (ch);
      DFIFO      = OTG_DFIFO[ch];
      ptr_URB    = CHURB[ch];                     /* Pointer to channels URB  */
      ptrData32  = (U32 *)(ptr_URB->ptrDataBuffer + ptr_URB->DataTransferred);
      len        = bcnt / 4;                      /* Received number of bytes */
      len_rest   = bcnt & 3;                      /* Number of bytes left     */
      while (len--) {
        *ptrData32++    = *DFIFO;
        ptr_URB->DataTransferred += 4;
      }
      if (len_rest) {
        dat      = *DFIFO;
        ptrData8 = (U8 *)ptrData32;
        while (len_rest--) {
          *ptrData8++   = dat;
          dat         >>= 8;
          ptr_URB->DataTransferred ++;
        }
      }
    } else {                                      /* If PKTSTS != 0x02        */
      grxsts     = OTG->GRXSTSP;
    }
    OTG->GINTMSK |= USBH_STM32_GINTMSK_RXFLVLM;
  }
                                                  /* Handle transmission int  */
  if (gintsts & USBH_STM32_GINTSTS_HCINT) {       /* If host channel interrupt*/
    ptr_CH = (USBH_STM32_CH *)(&(OTG->HCCHAR0));
    for (ch = 0; ch < OTG_MAX_CH; ch++) {
      if (haint & (1 << ch)) {                    /* If channels interrupt act*/
        hcint   = ptr_CH->HCINT & ptr_CH->HCINTMSK;
        ptr_URB = CHURB[ch];                      /* Pointer to channels URB  */
        ptr_URB->Error |= (hcint & USBH_STM32_HCINT_ERR) >> 7;
        if ((ptr_URB->PacketType == USBH_PACKET_OUT) ||     /* If OUT packet  ----------*/
            (ptr_URB->PacketType == USBH_PACKET_SETUP)) {   /* or SETUP packet----------*/
          if (hcint & USBH_STM32_HCINT_XFRC) {    /* If data transfer finished*/
            USBH_STM32_DMA_Stop();                /* Stop the DMA transfer    */
            ptr_CH->HCINTMSK         = 0;
            ptr_URB->DataTransferred = ptr_URB->DataLength;
            ptr_URB->Status          = 0;
            ptr_URB->ResponsePacketType = USBH_PACKET_ACK;
            ptr_URB->Completed       = 1;
            CHURB[ch]                = 0;
          } else if (hcint & USBH_STM32_HCINT_STALL) {      /* If STALL event */
            USBH_STM32_DMA_Stop();                /* Stop the DMA transfer    */
            ptr_URB->ResponsePacketType = USBH_PACKET_STALL;
            ptr_CH->HCINTMSK         = USBH_STM32_HCINT_CHH;
                                                  /* Halt the channel         */
            ptr_CH->HCCHAR          |= USBH_STM32_HCCHAR_CHDIS;
          } else if ((hcint & USBH_STM32_HCINT_NAK)   ||    /* If NAK received*/
                     (hcint & USBH_STM32_HCINT_TXERR)) {    /* If TXERR rece  */
            USBH_STM32_DMA_Stop();                /* Stop the DMA transfer    */
            if (hcint & USBH_STM32_HCINT_NAK) {
              ptr_URB->ResponsePacketType = USBH_PACKET_NAK;
              ptr_CH->HCINTMSK       = USBH_STM32_HCINT_CHH;
            } else {
              ptr_URB->Error         = USBH_STM32_HCINT_TXERR >> 7;
              ptr_CH->HCINTMSK       = USBH_STM32_HCINT_ACK | USBH_STM32_HCINT_CHH;
            }
            if (ptr_URB->DataLength) {
                                                  /* Update transfer info     */
              pktcnt                 = (ptr_CH->HCTSIZ >> 19) & 0x3FF;
              mpsiz                  = (ptr_CH->HCCHAR >>  0) & 0x7FF;

              ptr_URB->DataTransferred = (((ptr_URB->DataLength + mpsiz - 1) / mpsiz) - pktcnt) * mpsiz;
            }
                                                  /* Halt the channel         */
            ptr_CH->HCCHAR          |= USBH_STM32_HCCHAR_CHENA | USBH_STM32_HCCHAR_CHDIS;
          } else if (hcint&USBH_STM32_HCINT_CHH) {/* If channel halted        */
            if ((ptr_CH->EPTYP != USB_ENDPOINT_TYPE_INTERRUPT)   && 
                (ptr_URB->ResponsePacketType == USBH_PACKET_NAK) && 
                (CHURB[ch]->NAKRetries--)) {
                                                  /* Reenable channel         */
              USBH_STM32_CH_TransferEnqueue (ptr_CH, (U8)CHURB[ch]->Parameters, (U8 *)CHURB[ch]->ptrDataBuffer+CHURB[ch]->DataTransferred, (U32)CHURB[ch]->DataLength-CHURB[ch]->DataTransferred);
              CHURB[ch]->TimeoutCount= MAX_TIMEOUT_COUNT;
            } else {
              ptr_CH->HCINTMSK       = 0;
              ptr_URB->Submitted     = 0;
              ptr_URB->InProgress    = 0;
              ptr_URB->Completed     = 1;
              CHURB[ch]              = 0;
            }
          } else if (hcint&USBH_STM32_HCINT_ACK) {/* If ACK received          */
            ptr_URB->ResponsePacketType = USBH_PACKET_ACK;
            ptr_URB->Error           = 0;
            ptr_CH->HCINTMSK        &=~USBH_STM32_HCINT_ACK;
          }
        } else if (ptr_URB->PacketType == USBH_PACKET_IN) { /* If IN packet   ----------*/
          if (hcint & USBH_STM32_HCINT_XFRC) {
            ptr_URB->ResponsePacketType = USBH_PACKET_ACK;
            ptr_URB->Error           = 0;
            ptr_CH->HCINTMSK         = USBH_STM32_HCINT_CHH;
                                                  /* Halt the channel         */
            ptr_CH->HCCHAR          |= USBH_STM32_HCCHAR_CHENA | USBH_STM32_HCCHAR_CHDIS;
          } else if (hcint&USBH_STM32_HCINT_NAK) {/* If NAK received          */
            ptr_URB->ResponsePacketType = USBH_PACKET_NAK;
            if ((Port_Con) && (ptr_CH->EPTYP != USB_ENDPOINT_TYPE_INTERRUPT) && (CHURB[ch]->NAKRetries--)) {
                                                  /* Reenable channel         */
              ptr_CH->HCINTMSK       = USBH_STM32_HCINTMSK_DTERRM | 
                                       USBH_STM32_HCINTMSK_BBERRM | 
                                       USBH_STM32_HCINTMSK_TXERRM | 
                                       USBH_STM32_HCINTMSK_ACKM   | 
                                       USBH_STM32_HCINTMSK_NAKM   | 
                                       USBH_STM32_HCINTMSK_STALLM | 
                                       USBH_STM32_HCINTMSK_XFRCM  ;
              ptr_CH->HCCHAR        |= USBH_STM32_HCCHAR_CHENA;
              CHURB[ch]->TimeoutCount= MAX_TIMEOUT_COUNT;
            } else {
                                                  /* Halt the channel         */
              ptr_CH->HCINTMSK       = USBH_STM32_HCINT_CHH;
              ptr_CH->HCCHAR        |= USBH_STM32_HCCHAR_CHENA | USBH_STM32_HCCHAR_CHDIS;
            }
          } else if ((hcint & USBH_STM32_HCINT_TXERR) ||    /* If TXERR event */
                     (hcint & USBH_STM32_HCINT_BBERR) ||    /* If BBERR event */
                     (hcint & USBH_STM32_HCINT_STALL)) {    /* If STALL event */
            ptr_CH->HCINTMSK         = USBH_STM32_HCINT_CHH;
            if (hcint & USBH_STM32_HCINT_TXERR) {
              ptr_URB->Error         = USBH_STM32_HCINT_TXERR >> 7;
              ptr_CH->HCINTMSK      |= USBH_STM32_HCINT_ACK;
            } else if (hcint & USBH_STM32_HCINT_BBERR) {
              ptr_URB->Error         = USBH_STM32_HCINT_BBERR >> 7;
            } else {
              ptr_URB->ResponsePacketType = USBH_PACKET_STALL;
            }
                                                  /* Halt the channel         */
            ptr_CH->HCCHAR          |= USBH_STM32_HCCHAR_CHENA | USBH_STM32_HCCHAR_CHDIS;
          } else if (hcint&USBH_STM32_HCINT_CHH) {/* If Channel Halted        */
            ptr_CH->HCINTMSK         = 0;
            ptr_URB->Submitted       = 0;
            ptr_URB->InProgress      = 0;
            ptr_URB->Completed       = 1;
            CHURB[ch]                = 0;
            if (ptr_URB->Completed && ptr_URB->CompletedCallback) {
              ptr_URB->CompletedCallback();
            }
          } else if (hcint&USBH_STM32_HCINT_ACK) {/* If ACK received          */
            ptr_URB->ResponsePacketType = USBH_PACKET_ACK;
            ptr_URB->Error           = 0;
            if (ptr_CH->EPTYP != USB_ENDPOINT_TYPE_INTERRUPT) {
              ptr_CH->HCINTMSK       = USBH_STM32_HCINTMSK_DTERRM | 
                                       USBH_STM32_HCINTMSK_BBERRM | 
                                       USBH_STM32_HCINTMSK_TXERRM | 
                                       USBH_STM32_HCINTMSK_ACKM   | 
                                       USBH_STM32_HCINTMSK_NAKM   | 
                                       USBH_STM32_HCINTMSK_STALLM | 
                                       USBH_STM32_HCINTMSK_XFRCM  ;
                                                  /* Reenable channel         */
              ptr_CH->HCCHAR        |= USBH_STM32_HCCHAR_CHENA;
              CHURB[ch]->TimeoutCount= MAX_TIMEOUT_COUNT;
            } else {
              ptr_CH->HCINTMSK       = USBH_STM32_HCINT_CHH;
                                                  /* Halt the channel         */
              ptr_CH->HCCHAR        |= USBH_STM32_HCCHAR_CHENA | USBH_STM32_HCCHAR_CHDIS;
            }
          } else if (hcint&USBH_STM32_HCINT_DTERR) {/* If DTERR received      */
          }
        }
        ptr_CH->HCINT = 0x7FF;
      }
      ptr_CH++;
    }
    OTG->HAINT = haint;
  }  
  OTG->GINTSTS = gintsts;                         /* Clear core interrupts    */
  if (gintsts & USBH_STM32_GINTSTS_SOF) {         /* If start of frame int    */
    if (HW_Accessing) {
      act = 1;
    } else {
      act = 0;
      for (ch = 0; ch < OTG_MAX_CH; ch++) {
        if (CHURB[ch]) {
          if (CHURB[ch]->InProgress == 1) {       /* If any URB in progress   */
            act = 1;                              /* Set act to 1             */
            break;
          }
        }
      }
    }

    /* At this point act == 1 if there is USB bus activity                    */
    ptr_CH = (USBH_STM32_CH *)(&(OTG->HCCHAR0));
    for (ch = 0; ch < OTG_MAX_CH; ch++) {
      ptr_URB = CHURB[ch];                        /* Pointer to channels URB  */
      if (ptr_URB) {
        if ((ptr_URB->Submitted  == 1) &&         /* If URB is submitted      */
            (ptr_URB->InProgress == 0)) {         /* If URB not in progress   */
          if (ptr_CH->EPTYP == USB_ENDPOINT_TYPE_INTERRUPT) {
            if (cntInterval[ch]) {
              if ((act && (cntInterval[ch] > 1)) || !act)
                cntInterval[ch]--;
              }
              if (!act) {
                if (!cntInterval[ch]) {           /* If period expired        */
                  ptr_URB->InProgress = 1;
                  USBH_STM32_CH_TransferEnqueue (ptr_CH, (U8)ptr_URB->Parameters, (U8 *)ptr_URB->ptrDataBuffer, (U32)ptr_URB->DataLength);
                  act = 1;
                }
              }
          } else if (!act) {
            ptr_URB->InProgress = 1;
            USBH_STM32_CH_TransferEnqueue (ptr_CH, (U8)ptr_URB->Parameters, (U8 *)ptr_URB->ptrDataBuffer, (U32)ptr_URB->DataLength);
            act = 1;
          }
        }
      }
      ptr_CH++;
    }
  }
}
